# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documnetation](https://pandas.pydata.org/pandas-docs/stable/).

In [1]:
# Import pandas
import pandas as pd

In [2]:
# Create a series of three different colours
colours = pd.Series(['greeen', 'yellow', 'orange'])

In [3]:
# View the series of different colours
colours

0    greeen
1    yellow
2    orange
dtype: object

In [4]:
# Create a series of three different car types and view it
cars = pd.Series(['bmw', 'ferrari', 'audi'])
cars

0        bmw
1    ferrari
2       audi
dtype: object

In [5]:
# Combine the Series of cars and colours into a DataFrame
info = pd.DataFrame({'Cars': cars, 'Colours': colours})
info

      Cars Colours
0      bmw  greeen
1  ferrari  yellow
2     audi  orange

In [6]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
cars_sales = pd.read_csv('../data/car-sales.csv')
cars_sales.info

<bound method DataFrame.info of      Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00>

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [7]:
# Export the DataFrame you created to a .csv file
cars_sales.to_csv('../data/cars-sales-exported.csv')

In [8]:
# Find the different datatypes of the car data DataFrame
cars_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [9]:
# Describe your current car sales DataFrame using describe()
cars_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [10]:
# Get information about your DataFrame using info()
cars_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

What does it show you?

In [11]:
# Create a Series of different numbers and find the mean of them
numbers = pd.Series([7, 8, 9, 10])
numbers.mean()

8.5

In [12]:
# Create a Series of different numbers and find the sum of them
numbers.sum()

34

In [13]:
# List out all the column names of the car sales DataFrame
cars_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
# Find the length of the car sales DataFrame
len(cars_sales) # number of rows

10

In [15]:
# Show the first 5 rows of the car sales DataFrame
cars_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [16]:
# Show the first 7 rows of the car sales DataFrame
cars_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [17]:
# Show the bottom 5 rows of the car sales DataFrame
cars_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [18]:
# Use .loc to select the row at index 3 of the car sales DataFrame
cars_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [19]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
cars_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [20]:
# Select the "Odometer (KM)" column from the car sales DataFrame
cars_sales['Odometer (KM)']

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [21]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
cars_sales['Odometer (KM)'].mean()

78601.4

In [22]:
# Select the rows with over 100,000 kilometers on the Odometer
cars_sales[cars_sales['Odometer (KM)'] > 100_000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [23]:
# Create a crosstab of the Make and Doors columns
make = cars_sales['Make']
doors = cars_sales['Doors']
pd.crosstab(make, doors)

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [24]:
# Group columns of the car sales DataFrame by the Make column and find the average
cars_sales.groupby('Make').mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [25]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline
%matplotlib
import matplotlib.pyplot as plt
cars_sales['Odometer (KM)'].plot()

Using matplotlib backend: MacOSX

In [26]:
# Create a histogram of the Odometer column using hist()
cars_sales['Odometer (KM)'].hist()

In [27]:
# Try to plot the Price column using plot()
cars_sales['Price'].plot()

TypeError: no numeric data to plot

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string columb to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [28]:
# Remove the punctuation from price column
cars_sales['Price'] = cars_sales['Price'].str.replace('[\$\,\.]', '').astype(float)

In [29]:
# Check the changes to the price column
cars_sales['Price']

0     400000.0
1     500000.0
2     700000.0
3    2200000.0
4     350000.0
5     450000.0
6     750000.0
7     700000.0
8     625000.0
9     970000.0
Name: Price, dtype: float64

In [30]:
# Remove the two extra zeros at the end of the price column
cars_sales['Price'] = cars_sales['Price'] / 10

In [31]:
# Check the changes to the Price column
cars_sales['Price']

0     40000.0
1     50000.0
2     70000.0
3    220000.0
4     35000.0
5     45000.0
6     75000.0
7     70000.0
8     62500.0
9     97000.0
Name: Price, dtype: float64

In [32]:
# Change the datatype of the Price column to integers
cars_sales['Price'] = cars_sales['Price'].apply(lambda x : int(x))
cars_sales['Price']

0     40000
1     50000
2     70000
3    220000
4     35000
5     45000
6     75000
7     70000
8     62500
9     97000
Name: Price, dtype: int64

In [33]:
# Lower the strings of the Make column
cars_sales['Make'] = cars_sales['Make'].apply(lambda x : str.lower(x))
cars_sales['Make']

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [34]:
# Make lowering the case of the Make column permanent
cars_sales

     Make Colour  Odometer (KM)  Doors   Price
0  toyota  White         150043      4   40000
1   honda    Red          87899      4   50000
2  toyota   Blue          32549      3   70000
3     bmw  Black          11179      5  220000
4  nissan  White         213095      4   35000
5  toyota  Green          99213      4   45000
6   honda   Blue          45698      4   75000
7   honda   Blue          54738      4   70000
8  toyota  White          60000      4   62500
9  nissan  White          31600      4   97000

In [35]:
# Check the car sales DataFrame
cars_sales

     Make Colour  Odometer (KM)  Doors   Price
0  toyota  White         150043      4   40000
1   honda    Red          87899      4   50000
2  toyota   Blue          32549      3   70000
3     bmw  Black          11179      5  220000
4  nissan  White         213095      4   35000
5  toyota  Green          99213      4   45000
6   honda   Blue          45698      4   75000
7   honda   Blue          54738      4   70000
8  toyota  White          60000      4   62500
9  nissan  White          31600      4   97000

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [36]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")
cars_missing = pd.read_csv('../data/car-sales-missing-data.csv')
# Check out the new DataFrame
cars_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [37]:
# Fill the Odometer (KM) column missing values with the mean of the column inplace
cars_missing['Odometer'].fillna(cars_missing['Odometer'].mean(), inplace=True)

In [38]:
# View the car sales missing DataFrame and verify the changes
cars_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [39]:
# Remove the rest of the missing data inplace
cars_missing.dropna(inplace=True)

In [40]:
# Verify the missing values are removed by viewing the DataFrame
cars_missing

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

We'll now start to add columns to our DataFrame.

In [41]:
# Create a "Seats" column where every row has a value of 5
cars_sales['Seats'] = pd.Series([5])
cars_sales['Seats'].fillna(5, inplace=True)
cars_sales

     Make Colour  Odometer (KM)  Doors   Price  Seats
0  toyota  White         150043      4   40000    5.0
1   honda    Red          87899      4   50000    5.0
2  toyota   Blue          32549      3   70000    5.0
3     bmw  Black          11179      5  220000    5.0
4  nissan  White         213095      4   35000    5.0
5  toyota  Green          99213      4   45000    5.0
6   honda   Blue          45698      4   75000    5.0
7   honda   Blue          54738      4   70000    5.0
8  toyota  White          60000      4   62500    5.0
9  nissan  White          31600      4   97000    5.0

In [42]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame
import random
cars_sales['Engine Size'] = pd.Series([1.3])
cars_sales['Engine Size'] = cars_sales['Engine Size'].apply(lambda x : random.uniform(1.3, 4.5))
cars_sales

     Make Colour  Odometer (KM)  Doors   Price  Seats  Engine Size
0  toyota  White         150043      4   40000    5.0     3.057329
1   honda    Red          87899      4   50000    5.0     4.211261
2  toyota   Blue          32549      3   70000    5.0     4.097008
3     bmw  Black          11179      5  220000    5.0     2.013730
4  nissan  White         213095      4   35000    5.0     4.420726
5  toyota  Green          99213      4   45000    5.0     4.471898
6   honda   Blue          45698      4   75000    5.0     2.585997
7   honda   Blue          54738      4   70000    5.0     3.309885
8  toyota  White          60000      4   62500    5.0     2.290038
9  nissan  White          31600      4   97000    5.0     4.010662

In [43]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame
cars_sales['price_per_kilometer'] = cars_sales['Price'] / cars_sales['Odometer (KM)']
cars_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Engine Size,price_per_kilometer
0,toyota,White,150043,4,40000,5.0,3.057329,0.266590
1,honda,Red,87899,4,50000,5.0,4.211261,0.568835
2,toyota,Blue,32549,3,70000,5.0,4.097008,2.150604
3,bmw,Black,11179,5,220000,5.0,2.013730,19.679757
4,nissan,White,213095,4,35000,5.0,4.420726,0.164246
5,toyota,Green,99213,4,45000,5.0,4.471898,0.453570
6,honda,Blue,45698,4,75000,5.0,2.585997,1.641210
7,honda,Blue,54738,4,70000,5.0,3.309885,1.278819
8,toyota,White,60000,4,62500,5.0,2.290038,1.041667
9,nissan,White,31600,4,97000,5.0,4.010662,3.069620

In [44]:
# Remove the last column you added using .drop()
cars_sales.drop('price_per_kilometer', axis=1, inplace=True)
cars_sales

     Make Colour  Odometer (KM)  Doors   Price  Seats  Engine Size
0  toyota  White         150043      4   40000    5.0     3.057329
1   honda    Red          87899      4   50000    5.0     4.211261
2  toyota   Blue          32549      3   70000    5.0     4.097008
3     bmw  Black          11179      5  220000    5.0     2.013730
4  nissan  White         213095      4   35000    5.0     4.420726
5  toyota  Green          99213      4   45000    5.0     4.471898
6   honda   Blue          45698      4   75000    5.0     2.585997
7   honda   Blue          54738      4   70000    5.0     3.309885
8  toyota  White          60000      4   62500    5.0     2.290038
9  nissan  White          31600      4   97000    5.0     4.010662

In [45]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable
cars_shuffled = cars_sales.sample(frac=1)
cars_shuffled

     Make Colour  Odometer (KM)  Doors   Price  Seats  Engine Size
9  nissan  White          31600      4   97000    5.0     4.010662
6   honda   Blue          45698      4   75000    5.0     2.585997
4  nissan  White         213095      4   35000    5.0     4.420726
3     bmw  Black          11179      5  220000    5.0     2.013730
0  toyota  White         150043      4   40000    5.0     3.057329
7   honda   Blue          54738      4   70000    5.0     3.309885
8  toyota  White          60000      4   62500    5.0     2.290038
1   honda    Red          87899      4   50000    5.0     4.211261
5  toyota  Green          99213      4   45000    5.0     4.471898
2  toyota   Blue          32549      3   70000    5.0     4.097008

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [47]:
# Reset the indexes of the shuffled DataFrame
cars_shuffled.reset_index(inplace=True)
cars_shuffled

   index    Make Colour  Odometer (KM)  Doors   Price  Seats  Engine Size
0      9  nissan  White          31600      4   97000    5.0     4.010662
1      6   honda   Blue          45698      4   75000    5.0     2.585997
2      4  nissan  White         213095      4   35000    5.0     4.420726
3      3     bmw  Black          11179      5  220000    5.0     2.013730
4      0  toyota  White         150043      4   40000    5.0     3.057329
5      7   honda   Blue          54738      4   70000    5.0     3.309885
6      8  toyota  White          60000      4   62500    5.0     2.290038
7      1   honda    Red          87899      4   50000    5.0     4.211261
8      5  toyota  Green          99213      4   45000    5.0     4.471898
9      2  toyota   Blue          32549      3   70000    5.0     4.097008

Notice the index numbers have been changed to have order (start from 0).

In [54]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame
cars_sales['Odometer (KM)'] = cars_sales['Odometer (KM)'].apply(lambda x : x / 1.6)
cars_sales

     Make Colour  Odometer (KM)  Doors   Price  Seats  Engine Size
0  toyota  White   22894.744873      4   40000    5.0     3.057329
1   honda    Red   13412.322998      4   50000    5.0     4.211261
2  toyota   Blue    4966.583252      3   70000    5.0     4.097008
3     bmw  Black    1705.780029      5  220000    5.0     2.013730
4  nissan  White   32515.716553      4   35000    5.0     4.420726
5  toyota  Green   15138.702393      4   45000    5.0     4.471898
6   honda   Blue    6972.961426      4   75000    5.0     2.585997
7   honda   Blue    8352.355957      4   70000    5.0     3.309885
8  toyota  White    9155.273438      4   62500    5.0     2.290038
9  nissan  White    4821.777344      4   97000    5.0     4.010662

In [56]:
# Change the title of the Odometer (KM) to represent miles instead of kilometers
cars_sales.rename(columns={'Odometer (KM)': 'Odometer (Mi)'}, inplace=True)
cars_sales

     Make Colour  Odometer (Mi)  Doors   Price  Seats  Engine Size
0  toyota  White   22894.744873      4   40000    5.0     3.057329
1   honda    Red   13412.322998      4   50000    5.0     4.211261
2  toyota   Blue    4966.583252      3   70000    5.0     4.097008
3     bmw  Black    1705.780029      5  220000    5.0     2.013730
4  nissan  White   32515.716553      4   35000    5.0     4.420726
5  toyota  Green   15138.702393      4   45000    5.0     4.471898
6   honda   Blue    6972.961426      4   75000    5.0     2.585997
7   honda   Blue    8352.355957      4   70000    5.0     3.309885
8  toyota  White    9155.273438      4   62500    5.0     2.290038
9  nissan  White    4821.777344      4   97000    5.0     4.010662

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.